Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8C.xml
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Priority Register A for Slave 4" name="MATRIX_PRAS4" offset="0x00A0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Priority Register A for Slave 5" name="MATRIX_PRAS5" offset="0x00A8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
        </register>
        <register caption="Master Remap Control Register" name="MATRIX_MRCR" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Remap Command Bit for Master 0" mask="0x00000001" name="RCB0"/>
          <bitfield caption="Remap Command Bit for Master 1" mask="0x00000002" name="RCB1"/>
          <bitfield caption="Remap Command Bit for Master 2" mask="0x00000004" name="RCB2"/>
          <bitfield caption="Remap Command Bit for Master 3" mask="0x00000008" name="RCB3"/>
          <bitfield caption="Remap Command Bit for Master 4" mask="0x00000010" name="RCB4"/>
          <bitfield caption="Remap Command Bit for Master 5" mask="0x00000020" name="RCB5"/>
          <bitfield caption="Remap Command Bit for Master 6" mask="0x00000040" name="RCB6"/>
        </register>
        <register caption="System I/O Configuration Register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB10 or DDM Assignment" mask="0x00000400" name="SYSIO10"/>
          <bitfield caption="PB11 or DDP Assignment" mask="0x00000800" name="SYSIO11"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="SMC NAND Flash Chip Select Configuration Register" name="CCFG_SMCNFCS" offset="0x0124" rw="RW" size="4">
          <bitfield caption="SMC NAND Flash Chip Select 0 Assignment" mask="0x00000001" name="SMC_NFCS0"/>
          <bitfield caption="SMC NAND Flash Chip Select 1 Assignment" mask="0x00000002" name="SMC_NFCS1"/>
          <bitfield caption="SMC NAND Flash Chip Select 2 Assignment" mask="0x00000004" name="SMC_NFCS2"/>
          <bitfield caption="SMC NAND Flash Chip Select 3 Assignment" mask="0x00000008" name="SMC_NFCS3"/>
        </register>
        <register caption="Write Protect Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY (Write-only)" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
