Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4E8C.xml
        <register caption="Supply Controller Wake-up Mode Register" name="SUPC_WUMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Force Wake-up Enable" mask="0x00000001" name="FWUPEN" values="SUPC_WUMR__FWUPEN"/>
          <bitfield caption="Supply Monitor Wake-up Enable" mask="0x00000002" name="SMEN" values="SUPC_WUMR__SMEN"/>
          <bitfield caption="Real-time Timer Wake-up Enable" mask="0x00000004" name="RTTEN" values="SUPC_WUMR__RTTEN"/>
          <bitfield caption="Real-time Clock Wake-up Enable" mask="0x00000008" name="RTCEN" values="SUPC_WUMR__RTCEN"/>
          <bitfield caption="Low-power Debouncer Enable WKUP0" mask="0x00000020" name="LPDBCEN0" values="SUPC_WUMR__LPDBCEN0"/>
          <bitfield caption="Low-power Debouncer Enable WKUP1" mask="0x00000040" name="LPDBCEN1" values="SUPC_WUMR__LPDBCEN1"/>
          <bitfield caption="Low-power Debouncer Clear" mask="0x00000080" name="LPDBCCLR" values="SUPC_WUMR__LPDBCCLR"/>
          <bitfield caption="Force Wake-up Debouncer Period" mask="0x00000700" name="FWUPDBC" values="SUPC_WUMR__FWUPDBC"/>
          <bitfield caption="Wake-up Inputs Debouncer Period" mask="0x00007000" name="WKUPDBC" values="SUPC_WUMR__WKUPDBC"/>
          <bitfield caption="Low-power Debouncer Period" mask="0x00070000" name="LPDBC" values="SUPC_WUMR__LPDBC"/>
        </register>
        <register caption="Supply Controller Wake-up Inputs Register" name="SUPC_WUIR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Wake-up Input Enable 0" mask="0x00000001" name="WKUPEN0" values="SUPC_WUIR__WKUPEN0"/>
          <bitfield caption="Wake-up Input Enable 1" mask="0x00000002" name="WKUPEN1" values="SUPC_WUIR__WKUPEN1"/>
          <bitfield caption="Wake-up Input Enable 2" mask="0x00000004" name="WKUPEN2" values="SUPC_WUIR__WKUPEN2"/>
          <bitfield caption="Wake-up Input Enable 3" mask="0x00000008" name="WKUPEN3" values="SUPC_WUIR__WKUPEN3"/>
          <bitfield caption="Wake-up Input Enable 4" mask="0x00000010" name="WKUPEN4" values="SUPC_WUIR__WKUPEN4"/>
          <bitfield caption="Wake-up Input Enable 5" mask="0x00000020" name="WKUPEN5" values="SUPC_WUIR__WKUPEN5"/>
          <bitfield caption="Wake-up Input Enable 6" mask="0x00000040" name="WKUPEN6" values="SUPC_WUIR__WKUPEN6"/>
          <bitfield caption="Wake-up Input Enable 7" mask="0x00000080" name="WKUPEN7" values="SUPC_WUIR__WKUPEN7"/>
          <bitfield caption="Wake-up Input Enable 8" mask="0x00000100" name="WKUPEN8" values="SUPC_WUIR__WKUPEN8"/>
          <bitfield caption="Wake-up Input Enable 9" mask="0x00000200" name="WKUPEN9" values="SUPC_WUIR__WKUPEN9"/>
          <bitfield caption="Wake-up Input Enable 10" mask="0x00000400" name="WKUPEN10" values="SUPC_WUIR__WKUPEN10"/>
          <bitfield caption="Wake-up Input Enable 11" mask="0x00000800" name="WKUPEN11" values="SUPC_WUIR__WKUPEN11"/>
          <bitfield caption="Wake-up Input Enable 12" mask="0x00001000" name="WKUPEN12" values="SUPC_WUIR__WKUPEN12"/>
          <bitfield caption="Wake-up Input Enable 13" mask="0x00002000" name="WKUPEN13" values="SUPC_WUIR__WKUPEN13"/>
          <bitfield caption="Wake-up Input Enable 14" mask="0x00004000" name="WKUPEN14" values="SUPC_WUIR__WKUPEN14"/>
          <bitfield caption="Wake-up Input Enable 15" mask="0x00008000" name="WKUPEN15" values="SUPC_WUIR__WKUPEN15"/>
          <bitfield caption="Wake-up Input Type 0" mask="0x00010000" name="WKUPT0" values="SUPC_WUIR__WKUPT0"/>
          <bitfield caption="Wake-up Input Type 1" mask="0x00020000" name="WKUPT1" values="SUPC_WUIR__WKUPT1"/>
          <bitfield caption="Wake-up Input Type 2" mask="0x00040000" name="WKUPT2" values="SUPC_WUIR__WKUPT2"/>
          <bitfield caption="Wake-up Input Type 3" mask="0x00080000" name="WKUPT3" values="SUPC_WUIR__WKUPT3"/>
          <bitfield caption="Wake-up Input Type 4" mask="0x00100000" name="WKUPT4" values="SUPC_WUIR__WKUPT4"/>
          <bitfield caption="Wake-up Input Type 5" mask="0x00200000" name="WKUPT5" values="SUPC_WUIR__WKUPT5"/>
          <bitfield caption="Wake-up Input Type 6" mask="0x00400000" name="WKUPT6" values="SUPC_WUIR__WKUPT6"/>
          <bitfield caption="Wake-up Input Type 7" mask="0x00800000" name="WKUPT7" values="SUPC_WUIR__WKUPT7"/>
          <bitfield caption="Wake-up Input Type 8" mask="0x01000000" name="WKUPT8" values="SUPC_WUIR__WKUPT8"/>
          <bitfield caption="Wake-up Input Type 9" mask="0x02000000" name="WKUPT9" values="SUPC_WUIR__WKUPT9"/>
          <bitfield caption="Wake-up Input Type 10" mask="0x04000000" name="WKUPT10" values="SUPC_WUIR__WKUPT10"/>
          <bitfield caption="Wake-up Input Type 11" mask="0x08000000" name="WKUPT11" values="SUPC_WUIR__WKUPT11"/>
          <bitfield caption="Wake-up Input Type 12" mask="0x10000000" name="WKUPT12" values="SUPC_WUIR__WKUPT12"/>
          <bitfield caption="Wake-up Input Type 13" mask="0x20000000" name="WKUPT13" values="SUPC_WUIR__WKUPT13"/>
          <bitfield caption="Wake-up Input Type 14" mask="0x40000000" name="WKUPT14" values="SUPC_WUIR__WKUPT14"/>
          <bitfield caption="Wake-up Input Type 15" mask="0x80000000" name="WKUPT15" values="SUPC_WUIR__WKUPT15"/>
        </register>
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="FWUP Wake-up Status" mask="0x00000001" name="FWUPS" values="SUPC_SR__FWUPS"/>
          <bitfield caption="WKUP Wake-up Status" mask="0x00000002" name="WKUPS" values="SUPC_SR__WKUPS"/>
          <bitfield caption="Supply Monitor Detection Wake-up Status" mask="0x00000004" name="SMWS" values="SUPC_SR__SMWS"/>
          <bitfield caption="Brownout Detector Reset Status" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32-kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
          <bitfield caption="FWUP Input Status" mask="0x00001000" name="FWUPIS" values="SUPC_SR__FWUPIS"/>
          <bitfield caption="Low-power Debouncer Wake-up Status on WKUP0" mask="0x00002000" name="LPDBCS0" values="SUPC_SR__LPDBCS0"/>
          <bitfield caption="Low-power Debouncer Wake-up Status on WKUP1" mask="0x00004000" name="LPDBCS1" values="SUPC_SR__LPDBCS1"/>
          <bitfield caption="WKUP Input Status 0" mask="0x00010000" name="WKUPIS0" values="SUPC_SR__WKUPIS0"/>
          <bitfield caption="WKUP Input Status 1" mask="0x00020000" name="WKUPIS1" values="SUPC_SR__WKUPIS1"/>
          <bitfield caption="WKUP Input Status 2" mask="0x00040000" name="WKUPIS2" values="SUPC_SR__WKUPIS2"/>
          <bitfield caption="WKUP Input Status 3" mask="0x00080000" name="WKUPIS3" values="SUPC_SR__WKUPIS3"/>
          <bitfield caption="WKUP Input Status 4" mask="0x00100000" name="WKUPIS4" values="SUPC_SR__WKUPIS4"/>
          <bitfield caption="WKUP Input Status 5" mask="0x00200000" name="WKUPIS5" values="SUPC_SR__WKUPIS5"/>
          <bitfield caption="WKUP Input Status 6" mask="0x00400000" name="WKUPIS6" values="SUPC_SR__WKUPIS6"/>
          <bitfield caption="WKUP Input Status 7" mask="0x00800000" name="WKUPIS7" values="SUPC_SR__WKUPIS7"/>
          <bitfield caption="WKUP Input Status 8" mask="0x01000000" name="WKUPIS8" values="SUPC_SR__WKUPIS8"/>
          <bitfield caption="WKUP Input Status 9" mask="0x02000000" name="WKUPIS9" values="SUPC_SR__WKUPIS9"/>
          <bitfield caption="WKUP Input Status 10" mask="0x04000000" name="WKUPIS10" values="SUPC_SR__WKUPIS10"/>
          <bitfield caption="WKUP Input Status 11" mask="0x08000000" name="WKUPIS11" values="SUPC_SR__WKUPIS11"/>
          <bitfield caption="WKUP Input Status 12" mask="0x10000000" name="WKUPIS12" values="SUPC_SR__WKUPIS12"/>
          <bitfield caption="WKUP Input Status 13" mask="0x20000000" name="WKUPIS13" values="SUPC_SR__WKUPIS13"/>
          <bitfield caption="WKUP Input Status 14" mask="0x40000000" name="WKUPIS14" values="SUPC_SR__WKUPIS14"/>
          <bitfield caption="WKUP Input Status 15" mask="0x80000000" name="WKUPIS15" values="SUPC_SR__WKUPIS15"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__VROFF">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, asserts the vddcore_nreset and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
